### 데이터프레임의 데이터 조작

In [1]:
import numpy as np
import pandas as pd

- 데이터 갯수 세기

In [2]:
s = pd.Series(range(10))
s[3] = np.nan
s   # NaN = 실수 = float64

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [3]:
s.count()    # 데이터의 수 , NaN은 포함 안됨

9

In [6]:
np.random.seed(2021)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df.iloc[2, 3] = np.nan
df

     0    1    2    3
0  4.0  1.0  0.0  4.0
1  3.0  0.0  4.0  1.0
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0

In [7]:
df.count()  # 데이터의 수 : 데이터에서 값이 누락된 부분을 찾을 때 유용

0    4
1    4
2    4
3    3
dtype: int64

In [10]:
import seaborn as sns
titanic = sns.load_dataset("titanic")
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [11]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기

시리즈의 값이 정수, 문자열, 카테고리 값인 경우에는 value_counts 메서드로 각각의 값이 나온 횟수를 셀 수 있음

In [12]:
titanic.survived.value_counts()

0    549
1    342
Name: survived, dtype: int64

In [13]:
titanic['sex'].value_counts()

male      577
female    314
Name: sex, dtype: int64

- 정렬

In [14]:
df

     0    1    2    3
0  4.0  1.0  0.0  4.0
1  3.0  0.0  4.0  1.0
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0

In [16]:
df[0].sort_values()   # 데이터 값을 기준으로 정렬

2    1.0
3    2.0
1    3.0
0    4.0
Name: 0, dtype: float64

In [17]:
df[0].sort_values(ascending=False)   # 내림차순

0    4.0
1    3.0
3    2.0
2    1.0
Name: 0, dtype: float64

In [18]:
df[3].sort_values()  # NaN값이 있는 경우에는 정렬하면 NaN값이 가장 나중으로 감

1    1.0
3    1.0
0    4.0
2    NaN
Name: 3, dtype: float64

In [19]:
df.sort_values(by=0)   # by 인수로 정렬 기준이 되는 열을 지정

     0    1    2    3
2  1.0  1.0  4.0  NaN
3  2.0  0.0  3.0  1.0
1  3.0  0.0  4.0  1.0
0  4.0  1.0  0.0  4.0

In [21]:
titanic.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64

In [22]:
titanic.embarked.value_counts().sort_index()   # 인덱스 값을 기준으로 정렬

C    168
Q     77
S    644
Name: embarked, dtype: int64